// задача 1
// Напишите программу
// 1. на вход принимает число
// 2. выдает его квадрат 
Console.WriteLine("Введите число");
int number = Convert.ToInt32(Console.ReadLine());
int square = number * number; 
Console.WriteLine($"Квадрат числа {number} = {square}");
